# Получение текущей даты
current_date=$(date +%Y%m%d_%H%M)

# Формирование пустые данные в файл
echo "SWITCH_ID;BEGIN_TIME;END_TIME;DESCRIPTION;NETWORK_TYPE;SWITCH_TYPE;ADDRESS_TYPE_ID;ADDRESS_TYPE;ZIP;COUNTRY;REGION;ZONE;CITY;STREET;BUILDING;BUILD_SECT;APARTMENT;UNSTRUCT_INFO;SWITCH_SIGN;REGION_ID" > /home/ma43152/COPM/files/IP_PLAN_$current_date.txt
echo "1;2022-02-01 00:00:00;2049-12-31 59:59:00;DCN S5750E-26x-si 172.16.2.3 маршрутизатор широкополосного удаленного доступа в интернет;4;0;3;0;;Российская Федерация;Херсонская Область;Каховксий район;Каховка;Школьная (О.Лифинцева);1;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt
echo "2;2022-02-01 00:00:00;2049-12-31 59:59:00;DCN S5750E-28F-si-r 172.2.253 маршрутизатор широкополосного удаленного доступа в интернет;4;0;3;0;;Российская Федерация;Херсонская Область;Каховксий район;Каховка;Школьная (О.Лифинцева);1;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt
echo "3;2022-02-01 00:00:00;2049-12-31 59:59:00;Foxgate S6325-S4 172.16.2.2 маршрутизатор широкополосного удаленного доступа в интернет;4;0;3;0;;Российская Федерация;Херсонская Область;Каховксий район;Каховка;Школьная (О.Лифинцева);1;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt
echo "4;2022-02-01 00:00:00;2049-12-31 59:59:00;BDCOM OLT P3608-2TE 172.16.2.4 ;4;0;3;0;;Российская Федерация;Херсонская Область;Каховксий район;Каховка;Школьная (О.Лифинцева);1;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt
echo "5;2022-02-01 00:00:00;2049-12-31 59:59:00;BDCOM OLT P3608 172.16.2.5;4;0;3;0;;Российская Федерация;Херсонская Область;Каховксий район;Каховка;Школьная (О.Лифинцева);1;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt 
echo "6;2022-02-01 00:00:00;2049-12-31 59:59:00;BDCOM OLT P3608 172.16.2.6;4;0;3;0;;Российская Федерация;Херсонская Область;Каховксий район;Каховка;Школьная (О.Лифинцева);1;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt
echo "7;2022-02-01 00:00:00;2049-12-31 59:59:00;BDCOM OLT P3608-2TE 172.16.2.7;4;0;3;0;;Российская Федерация;Херсонская Область;Каховксий район;Каховка;Школьная (О.Лифинцева);1;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt
echo "8;2022-02-01 00:00:00;2049-12-31 59:59:00;BDCOM OLT P3608-2TE 172.16.2.8;4;0;3;0;;Российская Федерация;Херсонская Область;Каховксий район;Каховка;Школьная (О.Лифинцева);1;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt
echo "9;2022-02-01 00:00:00;2049-12-31 59:59:00;BDCOM OLT P3608-2TE 172.16.2.9;4;0;3;0;;Российская Федерация;Херсонская Область;Каховксий район;Каховка;Школьная (О.Лифинцева);1;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt
echo "10;2022-02-01 00:00:00;2049-12-31 59:59:00;BDCOM OLT P3608-2TE 172.16.2.10;4;0;3;0;;Российская Федерация;Херсонская Область;Каховксий район;Каховка;Школьная (О.Лифинцева);1;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt
echo "11;2022-02-01 00:00:00;2049-12-31 59:59:00;BDCOM OLT P3608-2TE 172.16.2.12;4;0;3;0;;Российская Федерация;Херсонская Область;Каховксий район;Каховка;Школьная (О.Лифинцева);1;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt
echo "12;2022-02-01 00:00:00;2049-12-31 59:59:00;BDCOM OLT P3608B 172.16.2.13;4;0;3;0;;Российская Федерация;Херсонская Область;Каховксий район;Каховка;Школьная (О.Лифинцева);1;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt
echo "13;2022-02-01 00:00:00;2049-12-31 59:59:00;BDCOM OLT P3608 172.16.2.15;4;0;3;0;;Российская Федерация;Херсонская Область;Каховксий район;Каховка;Школьная (О.Лифинцева);1;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt
echo "14;2022-02-01 00:00:00;2049-12-31 59:59:00;BDCOM OLT P3616-2TE 172.16.2.16;4;0;3;0;;Российская Федерация;Херсонская Область;Каховксий район;Каховка;Школьная (О.Лифинцева);1;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt
echo "15;2022-02-01 00:00:00;2049-12-31 59:59:00;Huawei MA5603T 172.16.2.22;4;0;3;0;;Российская Федерация;Херсонская Область;Каховксий район;Каховка;Школьная (О.Лифинцева);1;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt
echo "16;2022-02-01 00:00:00;2049-12-31 59:59:00;Huawei MA5608T 172.16.2.21;4;0;3;0;;Российская Федерация;Херсонская Область;Каховксий район;Каховка;417 Стрелковой Девизии ;63;63/2;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt
echo "17;2022-02-01 00:00:00;2049-12-31 59:59:00;C-Data FD1208S-R2-DAP 172.16.2.61;4;0;3;0;;Российская Федерация;Херсонская Область;Каховксий район;Софиевка;пер.Школьный;1;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt
echo "18;2022-02-01 00:00:00;2049-12-31 59:59:00;BDCOM OLT P3310B-2AC 172.16.3.6;4;0;3;0;;Российская Федерация;Херсонская Область;Каховксий район;Каховка;Школьная (О.Лифинцева);1;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt
echo "19;2022-02-01 00:00:00;2049-12-31 59:59:00;BDCOM OLT P3310B-2AC 172.16.3.4;4;0;3;0;;Российская Федерация;Херсонская Область;Каховксий район;Каховка;Школьная (О.Лифинцева);1;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt
echo "20;2022-02-01 00:00:00;2049-12-31 59:59:00;BDCOM S5612 172.16.3.254 маршрутизатор широкополосного удаленного доступа в интернет;4;0;3;0;;Российская Федерация;Херсонская Область;Новокаховский район;Таврийск;И.Франка ;15;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt
echo "21;2022-02-01 00:00:00;2049-12-31 59:59:00;BDCOM OLT P3608-2TE 172.16.2.11;4;0;3;0;;Российская Федерация;Херсонская Область;Новокаховский район;Таврийск;И.Франка ;15;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt
echo "22;2022-02-01 00:00:00;2049-12-31 59:59:00;BDCOM OLT P3310B-2AC 172.16.3.3;4;0;3;0;;Российская Федерация;Херсонская Область;Новокаховский район;Таврийск;И.Франка ;15;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt
echo "23;2022-02-01 00:00:00;2049-12-31 59:59:00;BDCOM OLT P3608-2TE 172.16.3.5;4;0;3;0;;Российская Федерация;Херсонская Область;Новокаховский район;Таврийск;И.Франка ;15;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt
echo "24;2022-02-01 00:00:00;2049-12-31 59:59:00;BDCOM OLT P3310B-2AC 172.16.3.7;4;0;3;0;;Российская Федерация;Херсонская Область;Новокаховский район;Таврийск;И.Франка ;15;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt
echo "25;2022-02-01 00:00:00;2049-12-31 59:59:00;BDCOM OLT P3608-2TE 172.16.3.2;4;0;3;0;;Российская Федерация;Херсонская Область;Новокаховский район;Таврийск;И.Франка ;15;;;;;4" >> /home/ma43152/COPM/files/COMMUTATORS_$current_date.txt

#
#
#   В таблицах данных нет, можно заполнить вручную по примеру ниже:
#       
#